In [10]:
from biblio_modules import load_csv_files_as_df, statistique_rapide_df
import pandas as pd
import pyarrow
import numpy as np
import matplotlib.pyplot as plt

pd.options.display.float_format = "{:.2f}".format

customers_xplo = pd.read_csv("../Source/customers.csv", sep=";")
products_xplo = pd.read_csv("../Source/products.csv", sep=";")
transactions_xplo = pd.read_csv("../Source/Transactions.csv", sep=";")

<div style="background-color: RGB(800,150,50);" >
<h2 style="margin: auto; padding: 20px; color:#fff; "> Exploration : customers </h2>
</div>

In [11]:
customers_xplo.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [12]:

display(f"les 3 colonnes de customers : {customers_xplo.columns.to_numpy()}")
display(f" L'année de naissance moyen est {round(customers_xplo.birth.mean())} ")
display(f" le client le plus vieux est né en {customers_xplo.birth.min()} ")
display(f" le client le plus jeune est né en {customers_xplo.birth.max()}")
display(f" le dataset est de dimension {customers_xplo.shape}")
display("""----------------------------------""")
display(f" le nombre de cellules NULL par colonne dans le dataset est de {customers_xplo.isna().sum()}")
display("""----------------------------------""")
display(f" la colonne 'sexe' devrait contenir deux valeurs max, et elle est de {customers_xplo['sex'].value_counts()}")
display("""----------------------------------""")
display(f" le nombre d'id_client unique est de {customers_xplo['client_id'].nunique()} pour {customers_xplo['client_id'].count()} lignes au total")
display("""----------------------------------""")
display(customers_xplo.describe(include='all'))
display("""----------------------------------""")
display(customers_xplo.info())

"les 3 colonnes de customers : ['client_id' 'sex' 'birth']"

" L'année de naissance moyen est 1978 "

' le client le plus vieux est né en 1929 '

' le client le plus jeune est né en 2004'

' le dataset est de dimension (8621, 3)'

'----------------------------------'

' le nombre de cellules NULL par colonne dans le dataset est de client_id    0\nsex          0\nbirth        0\ndtype: int64'

'----------------------------------'

" la colonne 'sexe' devrait contenir deux valeurs max, et elle est de sex\nf    4490\nm    4131\nName: count, dtype: int64"

'----------------------------------'

" le nombre d'id_client unique est de 8621 pour 8621 lignes au total"

'----------------------------------'

       client_id   sex   birth
count       8621  8621 8621.00
unique      8621     2     NaN
top       c_4410     f     NaN
freq           1  4490     NaN
mean         NaN   NaN 1978.28
std          NaN   NaN   16.92
min          NaN   NaN 1929.00
25%          NaN   NaN 1966.00
50%          NaN   NaN 1979.00
75%          NaN   NaN 1992.00
max          NaN   NaN 2004.00

'----------------------------------'

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8621 entries, 0 to 8620
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   client_id  8621 non-null   object
 1   sex        8621 non-null   object
 2   birth      8621 non-null   int64
dtypes: int64(1), object(2)
memory usage: 202.2+ KB

None

<div style="background-color: RGB(800,150,50);" >
<h2 style="margin: auto; padding: 20px; color:#fff; "> Exploration : products </h2>
</div>

In [13]:
products_xplo.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [14]:

display(f"les 3 colonnes de customers : {products_xplo.columns.to_numpy()}")
display(f" Le prix moyen sur le store en ligne {(round(products_xplo.price.mean(), 2))} euros")
display(f" le prix le plus bas dans le magasin en ligne et de {products_xplo.price.min()} euros")
display(f" le prix le plus haut dans le magasin en ligne et de {products_xplo.price.max()} euros")
display(f" le dataset est de dimension {products_xplo.shape}")
display("""----------------------------------""")
display(f" le nombre de cellules NULL par colonne dans le dataset est de {products_xplo.isna().sum()}")
display("""----------------------------------""")
display(f" la colonne 'categ' devrait contenir 3 categorie max, et elle est de {products_xplo['categ'].value_counts()}")
display("""----------------------------------""")
display(f" le nombre d'id_produit unique est de {products_xplo['id_prod'].nunique()} pour {products_xplo['id_prod'].count()} lignes au total")
display("""----------------------------------""")
display(products_xplo.describe(include='all'))
display("""----------------------------------""")
display(products_xplo.info())

"les 3 colonnes de customers : ['id_prod' 'price' 'categ']"

' Le prix moyen sur le store en ligne 21.86 euros'

' le prix le plus bas dans le magasin en ligne et de 0.62 euros'

' le prix le plus haut dans le magasin en ligne et de 300.0 euros'

' le dataset est de dimension (3286, 3)'

'----------------------------------'

' le nombre de cellules NULL par colonne dans le dataset est de id_prod    0\nprice      0\ncateg      0\ndtype: int64'

'----------------------------------'

" la colonne 'categ' devrait contenir 3 categorie max, et elle est de categ\n0    2308\n1     739\n2     239\nName: count, dtype: int64"

'----------------------------------'

" le nombre d'id_produit unique est de 3286 pour 3286 lignes au total"

'----------------------------------'

       id_prod   price   categ
count     3286 3286.00 3286.00
unique    3286     NaN     NaN
top     0_1421     NaN     NaN
freq         1     NaN     NaN
mean       NaN   21.86    0.37
std        NaN   29.85    0.62
min        NaN    0.62    0.00
25%        NaN    6.99    0.00
50%        NaN   13.07    0.00
75%        NaN   22.99    1.00
max        NaN  300.00    2.00

'----------------------------------'

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3286 entries, 0 to 3285
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id_prod  3286 non-null   object
 1   price    3286 non-null   float64
 2   categ    3286 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 77.1+ KB

None

<div style="background-color: RGB(800,150,50);" >
<h2 style="margin: auto; padding: 20px; color:#fff; "> Exploration : transactions </h2>
</div>

In [15]:
transactions_xplo.head()

  id_prod                        date session_id client_id
0  0_1259  2021-03-01 00:01:07.843138        s_1     c_329
1  0_1390  2021-03-01 00:02:26.047414        s_2     c_664
2  0_1352  2021-03-01 00:02:38.311413        s_3     c_580
3  0_1458  2021-03-01 00:04:54.559692        s_4    c_7912
4  0_1358  2021-03-01 00:05:18.801198        s_5    c_2033

In [16]:

display(f"les 4 colonnes de customers : {transactions_xplo.columns.to_numpy()}")
#display(f" Le prix moyen sur le store en ligne {(round(transactions_xplo.price.mean(), 2))} euros")
#display(f" le prix le plus bas dans le magasin en ligne et de {transactions_xplo.price.min()} euros")
#display(f" le prix le plus haut dans le magasin en ligne et de {transactions_xplo.price.max()} euros")
display(f" le dataset est de dimension {transactions_xplo.shape}")
display("""----------------------------------""")
display(f" le nombre de cellules NULL par colonne dans le dataset est de {transactions_xplo.isna().sum()}")
display("""----------------------------------""")
#display(f" la colonne 'categ' devrait contenir 3 categorie max, et elle est de {transactions_xplo['categ'].value_counts()}")
display("""----------------------------------""")
display(f" le nombre de'session_id' unique est de {transactions_xplo['session_id'].nunique()} pour {transactions_xplo['session_id'].count()} lignes au total")
display("""----------------------------------""")
display(transactions_xplo.describe(include='all'))
display("""----------------------------------""")
display(transactions_xplo.info())

"les 4 colonnes de customers : ['id_prod' 'date' 'session_id' 'client_id']"

' le dataset est de dimension (687534, 4)'

'----------------------------------'

' le nombre de cellules NULL par colonne dans le dataset est de id_prod       0\ndate          0\nsession_id    0\nclient_id     0\ndtype: int64'

'----------------------------------'

'----------------------------------'

" le nombre de'session_id' unique est de 345505 pour 687534 lignes au total"

'----------------------------------'

       id_prod                        date session_id client_id
count   687534                      687534     687534    687534
unique    3265                      687419     345505      8600
top      1_369  2021-10-06 21:29:59.752585   s_118668    c_1609
freq      2340                           2         14     25586

'----------------------------------'

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 687534 entries, 0 to 687533
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     687534 non-null  object
 1   date        687534 non-null  object
 2   session_id  687534 non-null  object
 3   client_id   687534 non-null  object
dtypes: object(4)
memory usage: 21.0+ MB

None